Autodesk.Revit.DB.SlabShapeEditor.PickSupport(Autodesk.Revit.DB.Line)
Picks an element to support the slab.  This method will define split lines and create constant bearing lines for the slab.
gLine: A line from a support element such as a beam.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input line is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input line is invalid.

Autodesk.Revit.DB.SlabShapeEditor.ResetSlabShape
Removes the modifications made during editing and resets the element geometry back to the unmodified state.
Remarks: Calling this method will reset the slab back to its original state and disable Slab Shape Editing.  If further
editing is needed, call Enable again.

Autodesk.Revit.DB.SlabShapeEditor.DrawSplitLine(Autodesk.Revit.DB.SlabShapeVertex,Autodesk.Revit.DB.SlabShapeVertex)
Draws a split line on the corresponding slab, roof or floor.
Remarks: Drawing a split line may result in multiple creases, for example when the line crosses existing creases or boundary edges.
startVertex: The vertex to start the split line.
endVertex: The vertex to end the split line.
Returns: The newly created creases.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input vertex is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the input vertex is invalid.

Autodesk.Revit.DB.SlabShapeEditor.DrawPoint(Autodesk.Revit.DB.XYZ)
Adds a point to the corresponding slab, roof or floor.
Remarks:
If the input location is not on the top face of the slab, this function will return null.
Drawing a point on boundary crease may increase the number of creases.
This method will regenerate the document even in manual regeneration mode.
location: The location of the point.
Returns: The newly created vertex.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the location is null.

Autodesk.Revit.DB.SlabShapeEditor.ModifySubElement(Autodesk.Revit.DB.SlabShapeCrease,System.Double)
Manipulates the crease on the corresponding slab, roof or floor.
crease: The crease.
offset: The new value of the crease offset, which is the average of offsets of its ends.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the crease is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the crease is invalid.

Autodesk.Revit.DB.SlabShapeEditor.ModifySubElement(Autodesk.Revit.DB.SlabShapeVertex,System.Double)
Manipulates an entity on the corresponding slab, roof or floor.
Manipulates the vertex on the corresponding slab, roof or floor.
vertex: The vertex.
offset: The new value of the vertex offset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the vertex is null.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the vertex is invalid.

Autodesk.Revit.DB.SlabShapeEditor.SlabShapeCreases
All of the creases that can be edited.

Autodesk.Revit.DB.SlabShapeEditor.SlabShapeVertices
All of the vertices that can be edited.

Autodesk.Revit.DB.SlabShapeEditor.Enable
Enables the slab shape editing functionality.

Autodesk.Revit.DB.SlabShapeEditor.IsEnabled
Identifies if the slab shape editing functionality is enabled.
Remarks:
If true, the creases and vertices are accessible and modifiable.
If false, no creases and vertices are accessible.

Autodesk.Revit.DB.SlabShapeEditor
An object used for Slab Shape Editing.
Remarks: The SlabShapeEditor can be obtained from a slab object, such as a roof or floor.